In [ ]:
# !pip install seaborn

# # 사용할 수 있는 데이터셋

Collecting seaborn
  Downloading seaborn-0.13.2-py3-none-any.whl.metadata (5.4 kB)
Requirement already satisfied: numpy!=1.24.0,>=1.20 in c:\source\pythonsource\.venv\lib\site-packages (from seaborn) (2.4.2)
Requirement already satisfied: pandas>=1.2 in c:\source\pythonsource\.venv\lib\site-packages (from seaborn) (3.0.1)
Collecting matplotlib!=3.6.1,>=3.4 (from seaborn)
  Downloading matplotlib-3.10.8-cp314-cp314-win_amd64.whl.metadata (52 kB)
Collecting contourpy>=1.0.1 (from matplotlib!=3.6.1,>=3.4->seaborn)
  Downloading contourpy-1.3.3-cp314-cp314-win_amd64.whl.metadata (5.5 kB)
Collecting cycler>=0.10 (from matplotlib!=3.6.1,>=3.4->seaborn)
  Downloading cycler-0.12.1-py3-none-any.whl.metadata (3.8 kB)
Collecting fonttools>=4.22.0 (from matplotlib!=3.6.1,>=3.4->seaborn)
  Downloading fonttools-4.61.1-cp314-cp314-win_amd64.whl.metadata (116 kB)
Collecting kiwisolver>=1.3.1 (from matplotlib!=3.6.1,>=3.4->seaborn)
  Downloading kiwisolver-1.4.9-cp314-cp314-win_amd64.whl.metadata (6.4 kB)
Requirement already satisfied: packaging>=20.0 in c:\source\pythonsource\.venv\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (26.0)
Collecting pillow>=8 (from matplotlib!=3.6.1,>=3.4->seaborn)
  Downloading pillow-12.1.1-cp314-cp314-win_amd64.whl.metadata (9.0 kB)
Collecting pyparsing>=3 (from matplotlib!=3.6.1,>=3.4->seaborn)
  Downloading pyparsing-3.3.2-py3-none-any.whl.metadata (5.8 kB)
Requirement already satisfied: python-dateutil>=2.7 in c:\source\pythonsource\.venv\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (2.9.0.post0)
Requirement already satisfied: tzdata in c:\source\pythonsource\.venv\lib\site-packages (from pandas>=1.2->seaborn) (2025.3)
Requirement already satisfied: six>=1.5 in c:\source\pythonsource\.venv\lib\site-packages (from python-dateutil>=2.7->matplotlib!=3.6.1,>=3.4->seaborn) (1.17.0)
Downloading seaborn-0.13.2-py3-none-any.whl (294 kB)
Downloading matplotlib-3.10.8-cp314-cp314-win_amd64.whl (8.3 MB)
   ---------------------------------------- 0.0/8.3 MB ? eta -:--:--
   ---------------------------------------- 8.3/8.3 MB 43.0 MB/s  0:00:00
Downloading contourpy-1.3.3-cp314-cp314-win_amd64.whl (232 kB)
Downloading cycler-0.12.1-py3-none-any.whl (8.3 kB)
Downloading fonttools-4.61.1-cp314-cp314-win_amd64.whl (2.3 MB)
   ---------------------------------------- 0.0/2.3 MB ? eta -:--:--
   ---------------------------------------- 2.3/2.3 MB 59.0 MB/s  0:00:00
Downloading kiwisolver-1.4.9-cp314-cp314-win_amd64.whl (75 kB)
Downloading pillow-12.1.1-cp314-cp314-win_amd64.whl (7.2 MB)
   ---------------------------------------- 0.0/7.2 MB ? eta -:--:--
   ----------------------------- ---------- 5.2/7.2 MB 26.4 MB/s eta 0:00:01
   ---------------------------------------- 7.2/7.2 MB 26.3 MB/s  0:00:00
Downloading pyparsing-3.3.2-py3-none-any.whl (122 kB)
Installing collected packages: pyparsing, pillow, kiwisolver, fonttools, cycler, contourpy, matplotlib, seaborn

   ---------------------------------------- 0/8 [pyparsing]
   ---------------------------------------- 0/8 [pyparsing]
   ----- ---------------------------------- 1/8 [pillow]
   ----- ---------------------------------- 1/8 [pillow]
   ----- ---------------------------------- 1/8 [pillow]
   ----- ---------------------------------- 1/8 [pillow]
   ----- ---------------------------------- 1/8 [pillow]
   ----- ---------------------------------- 1/8 [pillow]
   ----- ---------------------------------- 1/8 [pillow]
   ----- ---------------------------------- 1/8 [pillow]
   ----- ---------------------------------- 1/8 [pillow]
   ----- ---------------------------------- 1/8 [pillow]
   --------------- ------------------------ 3/8 [fonttools]
   --------------- ------------------------ 3/8 [fonttools]
   --------------- ------------------------ 3/8 [fonttools]
   --------------- ------------------------ 3/8 [fonttools]
   --------------- ------------------------ 3/8 [fonttools]
   --------------- ------------------------ 3/8 [fonttools]
   --------------- ------------------------ 3/8 [fonttools]
   --------------- ------------------------ 3/8 [fonttools]
   --------------- ------------------------ 3/8 [fonttools]
   --------------- ------------------------ 3/8 [fonttools]
   --------------- ------------------------ 3/8 [fonttools]
   --------------- ------------------------ 3/8 [fonttools]
   --------------- ------------------------ 3/8 [fonttools]
   --------------- ------------------------ 3/8 [fonttools]
   --------------- ------------------------ 3/8 [fonttools]
   --------------- ------------------------ 3/8 [fonttools]
   --------------- ------------------------ 3/8 [fonttools]
   --------------- ------------------------ 3/8 [fonttools]
   --------------- ------------------------ 3/8 [fonttools]
   --------------- ------------------------ 3/8 [fonttools]
   --------------- ------------------------ 3/8 [fonttools]
   --------------- ------------------------ 3/8 [fonttools]
   --------------- ------------------------ 3/8 [fonttools]
   --------------- ------------------------ 3/8 [fonttools]
   --------------- ------------------------ 3/8 [fonttools]
   --------------- ------------------------ 3/8 [fonttools]
   --------------- ------------------------ 3/8 [fonttools]
   --------------- ------------------------ 3/8 [fonttools]
   --------------- ------------------------ 3/8 [fonttools]
   --------------- ------------------------ 3/8 [fonttools]
   --------------- ------------------------ 3/8 [fonttools]
   --------------- ------------------------ 3/8 [fonttools]
   -------------------- ------------------- 4/8 [cycler]
   ------------------------- -------------- 5/8 [contourpy]
   ------------------------------ --------- 6/8 [matplotlib]
   ------------------------------ --------- 6/8 [matplotlib]
   ------------------------------ --------- 6/8 [matplotlib]
   ------------------------------ --------- 6/8 [matplotlib]
   ------------------------------ --------- 6/8 [matplotlib]
   ------------------------------ --------- 6/8 [matplotlib]
   ------------------------------ --------- 6/8 [matplotlib]
   ------------------------------ --------- 6/8 [matplotlib]
   ------------------------------ --------- 6/8 [matplotlib]
   ------------------------------ --------- 6/8 [matplotlib]
   ------------------------------ --------- 6/8 [matplotlib]
   ------------------------------ --------- 6/8 [matplotlib]
   ------------------------------ --------- 6/8 [matplotlib]
   ------------------------------ --------- 6/8 [matplotlib]
   ------------------------------ --------- 6/8 [matplotlib]
   ------------------------------ --------- 6/8 [matplotlib]
   ------------------------------ --------- 6/8 [matplotlib]
   ------------------------------ --------- 6/8 [matplotlib]
   ------------------------------ --------- 6/8 [matplotlib]
   ------------------------------ --------- 6/8 [matplotlib]
   ------------------------------ --------- 6/8 [matplotlib]
   ------------------------------ --------- 6/8 [matplotlib]
   ------------------------------ --------- 6/8 [matplotlib]
   ------------------------------ --------- 6/8 [matplotlib]
   ------------------------------ --------- 6/8 [matplotlib]
   ------------------------------ --------- 6/8 [matplotlib]
   ------------------------------ --------- 6/8 [matplotlib]
   ------------------------------ --------- 6/8 [matplotlib]
   ------------------------------ --------- 6/8 [matplotlib]
   ------------------------------ --------- 6/8 [matplotlib]
   ------------------------------ --------- 6/8 [matplotlib]
   ------------------------------ --------- 6/8 [matplotlib]
   ------------------------------ --------- 6/8 [matplotlib]
   ------------------------------ --------- 6/8 [matplotlib]
   ------------------------------ --------- 6/8 [matplotlib]
   ------------------------------ --------- 6/8 [matplotlib]
   ------------------------------ --------- 6/8 [matplotlib]
   ------------------------------ --------- 6/8 [matplotlib]
   ----------------------------------- ---- 7/8 [seaborn]
   ----------------------------------- ---- 7/8 [seaborn]
   ----------------------------------- ---- 7/8 [seaborn]
   ----------------------------------- ---- 7/8 [seaborn]
   ----------------------------------- ---- 7/8 [seaborn]
   ----------------------------------- ---- 7/8 [seaborn]
   ----------------------------------- ---- 7/8 [seaborn]
   ---------------------------------------- 8/8 [seaborn]

Successfully installed contourpy-1.3.3 cycler-0.12.1 fonttools-4.61.1 kiwisolver-1.4.9 matplotlib-3.10.8 pillow-12.1.1 pyparsing-3.3.2 seaborn-0.13.2

[notice] A new release of pip is available: 25.3 -> 26.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [22]:
import pandas as pd
import seaborn as sns

#### subset 
- head(n) / tail(n) / sample() / nlargest() / nsmall() 
- iloc[], loc[]

In [3]:
sample_df = pd.read_excel("./data/sample.xlsx")
sample_df.head()

  Sap Co.      대리점 영업사원       전월       금월  TEAM  총 판매수량
0  KI1316  경기수원대리점  이기정  1720000  2952000     1     123
1  KI1451  충청홍성대리점  정미진  4080000  2706000     2     220
2  KI1534  경기화성대리점  경인선   600000  2214000     1     320
3  KI1636  강원속초대리점  이동권  3720000  2870000     3     110
4  KI1735  경기안양대리점  강준석  4800000  2296000     1     134

In [5]:
# 무작위로 샘플 조회
sample_df.sample(n=3)

   Sap Co.       대리점 영업사원       전월       금월  TEAM  총 판매수량
6   KI1917   경기광주대리점  김진혜  1292000  1518000     1     110
14  KI2776  경기남양주대리점  김수진  8160000  4352000     2     354
5   KI1875  제주제주시대리점  민경수  3420000  2346000     4     210

In [6]:
sample_df.sample(frac=0.3)

   Sap Co.       대리점 영업사원       전월       금월  TEAM  총 판매수량
5   KI1875  제주제주시대리점  민경수  3420000  2346000     4     210
11  KI2433   경기계양대리점  이희영  1833000  1404000     1     110
9   KI2214   경기성남대리점  이준수  1976000  1518000     3      73
2   KI1534   경기화성대리점  경인선   600000  2214000     1     320
16  KI2910   강원춘천대리점  김은향  4800000  4896000     1     176
3   KI1636   강원속초대리점  이동권  3720000  2870000     3     110

In [ ]:
# 전월에서 가장 숫자가 큰 2개
sample_df.nlargest(n=2, columns="전월")

   Sap Co.       대리점 영업사원       전월       금월  TEAM  총 판매수량
14  KI2776  경기남양주대리점  김수진  8160000  4352000     2     354
15  KI2870  경기구리시대리점  박진형  6000000  3400000     2     143

In [ ]:
# 컬럼에서 가장 숫자가 작은 항목 2개
sample_df.nsmallest(n=2, columns="전월")

   Sap Co.        대리점 영업사원      전월       금월  TEAM  총 판매수량
10  KI2313  제주서귀포시대리점  온지수  152000   945000     1      52
2   KI1534    경기화성대리점  경인선  600000  2214000     1     320

In [9]:
sample_df.columns

Index(['Sap Co.', '대리점', '영업사원', '전월', '금월', 'TEAM', '총 판매수량'], dtype='str')

In [ ]:
# 대리점, 영업사원, 전월, 금월 컬럼만 추출

# sample_df[['대리점', '영업사원', '전월', '금월']]
# sample_df.iloc[:,1:5]
sample_df.loc[:,"대리점":"금월"]

In [ ]:
# list : 리스트 만들기
# 빈 문자열, 
list1 = list('abcde')
list1

['a', 'b', 'c', 'd', 'e']

In [15]:
# 중복 데이터 제거 후 추출

# df = pd.DataFrame({"a":[4,5,6,6],"b":[7,8,9,9],"c":[10,11,12,12]}, index=['a','b','c','d'])
df = pd.DataFrame({"a":[4,5,6,6],"b":[7,8,9,9],"c":[10,11,12,12]}, index=list('abcd'))
df

   a  b   c
a  4  7  10
b  5  8  11
c  6  9  12
d  6  9  12

In [17]:
# 중복 행 제거

df.drop_duplicates(inplace=True)

In [18]:
df

   a  b   c
a  4  7  10
b  5  8  11
c  6  9  12

In [19]:
# 중복 행 제거 + 조건
df.drop_duplicates("a",inplace=True)

In [20]:
df

   a  b   c
a  4  7  10
b  5  8  11
c  6  9  12

In [24]:
iris_df = sns.load_dataset("iris")
iris_df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [25]:
# 전체 행, 열의 개수 확인

iris_df.shape

(150, 5)

In [27]:
# species 종류별 데이터 개수

iris_df['species'].value_counts()

species
setosa        50
versicolor    50
virginica     50
Name: count, dtype: int64

In [29]:
# unique(중복 없이) + string(문자열) 로 데이터 구분
iris_df['species'].unique()

<StringArray>
['setosa', 'versicolor', 'virginica']
Length: 3, dtype: str

In [30]:
# 기술 요약 통계 

iris_df.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [31]:
iris_df.info()

<class 'pandas.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    str
dtypes: float64(4), str(1)
memory usage: 6.0 KB

In [32]:
iris_df.sum()

sepal_length                                                876.5
sepal_width                                                 458.6
petal_length                                                563.7
petal_width                                                 179.9
species         setosasetosasetosasetosasetosasetosasetosaseto...
dtype: object

In [34]:
# string 은 sum()으로 더해질 수 있지만, 그 외의 mean(평균) 등의 산수는 오류

# iris_df.mean()
iris_df.mean(numeric_only=True)

sepal_length    5.843333
sepal_width     3.057333
petal_length    3.758000
petal_width     1.199333
dtype: float64

In [35]:
iris_df.median(numeric_only=True)

sepal_length    5.80
sepal_width     3.00
petal_length    4.35
petal_width     1.30
dtype: float64

In [37]:
iris_df.quantile([0.25,0.75],numeric_only=True)

      sepal_length  sepal_width  petal_length  petal_width
0.25           5.1          2.8           1.6          0.3
0.75           6.4          3.3           5.1          1.8

In [38]:
# null? not null? in?

df = pd.DataFrame({"a":[4,5,6,6],"b":[7,8,9,9],"c":[10,11,12,12]}, index=list('abcd'))
df

   a  b   c
a  4  7  10
b  5  8  11
c  6  9  12
d  6  9  12

In [39]:
# b 값이 7이 아닌

df[df.b != 7]

   a  b   c
b  5  8  11
c  6  9  12
d  6  9  12

In [41]:
# b 값이 7이 아닌 / a, b 컬럼만 조회

df.loc[df.b != 7, "a":"b"]

   a  b
b  5  8
c  6  9
d  6  9

In [45]:
# a 컬럼에 5 가 들어있는지 확인
# df[ true에 해당하는 값만 출력 ]

df[df.a.isin([5])]

   a  b   c
b  5  8  11

In [ ]:
# isna(), isnull()
# isna() : for문을 돌리지 않아도 na=null null인지 확인 가능

df.isna()

# a 컬럼이 null 인지 확인
df.a.isnull()

       a      b      c
a  False  False  False
b  False  False  False
c  False  False  False
d  False  False  False

In [48]:
# 해당 셀이 null인지 확인 -> null이 아니면 NaN 출력
df[df.isnull()]

    a   b   c
a NaN NaN NaN
b NaN NaN NaN
c NaN NaN NaN
d NaN NaN NaN

In [50]:
df = pd.DataFrame({"a":[4,5,6,6,pd.NA], "b":[7,8,pd.NA,9,9],"c":[10,11,12,pd.NaT,12]}, index=[1,2,3,4,5])
df

      a     b    c
1     4     7   10
2     5     8   11
3     6  <NA>   12
4     6     9  NaT
5  <NA>     9   12

In [51]:
df.isna()

       a      b      c
1  False  False  False
2  False  False  False
3  False   True  False
4  False  False   True
5   True  False  False

In [54]:
# df[df.isna()]

df.a.isna()
df.isna().sum()

a    1
b    1
c    1
dtype: int64

In [56]:
df.notna()
df.notnull()

       a      b      c
1   True   True   True
2   True   True   True
3   True  False   True
4   True   True  False
5  False   True   True

In [ ]:
# null 들어있으면 해당 행을 전부 날림
# 널값 존재하면 모두 제거
df.dropna()

   a  b   c
1  4  7  10
2  5  8  11

In [59]:
# null 값 + 어떤조건이 있으면 지워달라
df.dropna(axis=0)

   a  b   c
1  4  7  10
2  5  8  11

In [ ]:
# null 값이면 특정 값으로 채우기

# null 값이면 0으로 출력
df.fillna(0)

In [72]:
df = sns.load_dataset("mpg")
df.head(3)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite

In [61]:
# group by 

df.groupby("origin")

In [73]:
df.groupby("origin").count()
df.groupby("origin").size()
df.groupby("origin")['weight']
df.groupby(["origin",'model_year'])['cylinders'].mean()
# 여러 개의 함수 사용 sum mean(평균) std(표준편차)
df.groupby("origin")['horsepower'].agg(['sum','mean','std'])

            sum        mean        std
origin
europe   5478.0   80.558824  20.157871
japan    6307.0   79.835443  17.819199
usa     29167.0  119.048980  39.897790

In [64]:
student_list = {
    "name":["John","Nate","Abraham","Brian","Janny","Yuna","Jeniffer","Edward","Zara","Wendy","Sera"],
    "major":["Computer Science","Computer Science","Pyhsics","Psychology","Economics","Economics","Computer Science","Psychology","Pyhsics","Pyhsics","Economics"],
    "gender":["male","male","male","male","female","female","female","male","male","female","female"]
}

df = pd.DataFrame(student_list)
df

        name             major  gender
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Pyhsics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward        Psychology    male
8       Zara           Pyhsics    male
9      Wendy           Pyhsics  female
10      Sera         Economics  female

In [ ]:
# 컬럼별 항목 통계
# df.groupby("major").count()
df.groupby("major")['name'].count()

major
Computer Science    3
Economics           3
Psychology          2
Pyhsics             3
Name: name, dtype: int64

In [70]:
# gender의 이름 계수
df.groupby("gender")['name'].count()

gender
female    5
male      6
Name: name, dtype: int64

#### apply()

In [74]:
df = pd.DataFrame({"yyyy-mm-dd":['2005-09-28','2007-10-05','2012-12-20']})
df

   yyyy-mm-dd
0  2005-09-28
1  2007-10-05
2  2012-12-20

In [76]:
def extract_year(value):
    return value.split("-")[0]

In [77]:
# year 컬럼 생성

# Directely Create X
# df['year']=['2005']

df['year'] = df['yyyy-mm-dd'].apply(extract_year)
df

   yyyy-mm-dd  year
0  2005-09-28  2005
1  2007-10-05  2007
2  2012-12-20  2012

In [79]:

def get_age(year, curr_year):
    return curr_year - int(year)

In [80]:
# age 컬럼 생성

df['age'] = df['year'].apply(get_age, curr_year=2026)
df

   yyyy-mm-dd  year  age
0  2005-09-28  2005   21
1  2007-10-05  2007   19
2  2012-12-20  2012   14

In [82]:
df = pd.DataFrame({"영어":[60,70],"수학":[100,50]},index=["Dave","David"])
df

       영어   수학
Dave   60  100
David  70   50

In [89]:
def func(df):
    # print(df.index)
    # print(df.values)
    df['영어'] = 80
    return df

In [ ]:
# (default) axis = 0 (apply in colums, ↓, default) 
#           axis = 1 (apply in rows, → ) 
df.apply(func, axis=0)

Index(['Dave', 'David'], dtype='str')
[60 70]
Index(['Dave', 'David'], dtype='str')
[100  50]

       영어   수학
Dave   60  100
David  70   50

In [ ]:
# 영어, 수학을 동일하게 80점을 적용
# (일반적) 함수로 원하는 컬럼에 원하는 형태대로 적용

df2 = df.apply(func, axis=1)
df2

       영어   수학
Dave   80  100
David  80   50

#### 타이타닉

In [93]:
import pandas as pd
import seaborn as sns

In [ ]:
# seaborn Data set
# titanic_df = sns.load_dataset("titanic")

In [ ]:
# train.xlsc -> titanic_df 

titanic_df = pd.read_excel("./data/train.xlsx")
titanic_df

### 데이터 분석
- 데이터 구조

In [94]:
# 전체 행, 수
titanic_df.shape

(891, 12)

In [95]:
titanic_df.info()

<class 'pandas.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    str
 4   Gender       891 non-null    str
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    str
 11  Embarked     889 non-null    str
dtypes: float64(2), int64(5), object(1), str(4)
memory usage: 83.7+ KB

In [96]:
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
# PassengerId: 승객번호 , Survived: 생존여부(사망:0, 생존:1), Pclass(객실등급 1:Upper,2:Middle,3:Lower), 
# Name, Gender, Age, 
# SibSp : sibling, Spouse (탑승한 형제자매/배우자 수),
# Parch : parent, child (탑승한 부모/자녀 수), 
# Ticket : 티켓 정보, 
# Fare : 요금, 
# Cabin : 객실 관련 정보, 
# Embarked : 승선지(C,Q,S..)

titanic_df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Gender', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='str')

In [98]:
titanic_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [99]:
titanic_df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Gender           0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [ ]:
# null 값(누락값)을 제외한 필드 기술요약통계 정보 조회
titanic_df.dropna().describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,183.000000,183.000000,183.000000,183.000000,183.000000,183.000000,183.000000
mean,455.366120,0.672131,1.191257,35.674426,0.464481,0.475410,78.682469
std,247.052476,0.470725,0.515187,15.643866,0.644159,0.754617,76.347843
min,2.000000,0.000000,1.000000,0.920000,0.000000,0.000000,0.000000
25%,263.500000,0.000000,1.000000,24.000000,0.000000,0.000000,29.700000
50%,457.000000,1.000000,1.000000,36.000000,0.000000,0.000000,57.000000
75%,676.000000,1.000000,1.000000,47.500000,1.000000,1.000000,90.000000
max,890.000000,1.000000,3.000000,80.000000,3.000000,4.000000,512.329200

In [102]:
# Pclass 클래스별 탑승자

titanic_df.groupby("Pclass")['PassengerId'].count()

Pclass
1    216
2    184
3    491
Name: PassengerId, dtype: int64

In [ ]:
## [] Series 형태로 출력
## [[]] DataFrame 형태로 출력 
titanic_df.groupby("Pclass")[['PassengerId']].count()

        PassengerId
Pclass
1               216
2               184
3               491

In [ ]:
# 시각화(차트)


# 생존자 정보

titanic_df[titanic_df.Survived == 1]

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

In [ ]:
# 나이(Age) 30 초과인 승객 정보 

titanic_df[titanic_df.Age > 30]

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
...,...,...,...,...,...,...,...,...,...,...,...,...
873,874,0,3,"Vander Cruyssen, Mr. Victor",male,47.0,0,0,345765,9.0000,NaN,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [ ]:
# 성별 탑승자

# male 인 탑승자 목록
titanic_df.Gender == 'male'

# 성별 탑승자 수
titanic_df['Gender'].value_counts()

Gender
male      577
female    314
Name: count, dtype: int64

In [111]:
# 클래스, 성별, 나이의 중앙값

titanic_df.groupby(['Pclass','Gender'])['Age'].count()
titanic_df.groupby(['Pclass','Gender'])['Age'].median()

Pclass  Gender
1       female    35.0
        male      40.0
2       female    28.0
        male      30.0
3       female    21.5
        male      25.0
Name: Age, dtype: float64

In [114]:
# 요금 지불 비용이 20보다 작은 승객에 대해 Pclass 별 중앙값

titanic_df[titanic_df.Fare<20].groupby('Pclass').median(numeric_only=True)

        PassengerId  Survived   Age  SibSp  Parch     Fare
Pclass
1             811.5       0.0  38.5    0.0    0.0   0.0000
2             416.0       0.0  30.0    0.0    0.0  13.0000
3             442.0       0.0  25.0    0.0    0.0   7.8958